In [1]:
from pyspark.sql import SparkSession

spark = SparkSession.builder.master('local').appName('titanic').getOrCreate()

filepath = '/home/ubuntu/working/spark-examples/data/titanic_train.csv'
titanic_sdf = spark.read.csv(filepath,
                            inferSchema = True, # ë°ì´í„°ì˜ íƒ€ì…ì„ ìŠ¤íŒŒí¬ê°€ ìë™ìœ¼ë¡œ ì¸ì‹
                            header = True, # ì²« ì¤„ì„ ë¶ˆëŸ¬ì˜¬ì§€ ë§ì§€ë¥¼ ê²°ì •
                            )
titanic_sdf.show(5)

WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.apache.spark.unsafe.Platform (file:/home/ubuntu/spark-3.2.4/jars/spark-unsafe_2.12-3.2.4.jar) to constructor java.nio.DirectByteBuffer(long,int)
WARNING: Please consider reporting this to the maintainers of org.apache.spark.unsafe.Platform
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
23/06/07 05:06:55 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
23/06/07 05:06:56 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
23/06/07 05:06:56 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 5 rows

In [3]:
import pandas as pd

titanic_pdf = pd.read_csv(filepath, header = 'infer')
titanic_pdf.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### pandas DataFrameì˜ head()ì™€ spark DataFrame head() ë¹„êµ ë° print() ì ìš© ì‹œ ì°¨ì´
- pandas DataFrameì˜ head(N)ëŠ” Dataframeì˜ ì„ ë‘ Nê°œ `record`ë¥¼ ê°€ì§€ëŠ” Dataframe ë°˜í™˜
- spark DataFrameì˜ head(N)ëŠ” DataFrameì˜ ì„ ë‘ Nê°œ `row object`ë¥¼ listë¡œ ë°˜í™˜
- spark Dataframeì˜ limit(N)ê°€ DataFrameì˜ ì„ ë‘ Nê°œ Recordë¥¼ ê°€ì§€ëŠ” Dataframeì„ ë°˜í™˜.
- pandas dataframeì€ print()ì ìš© ì‹œ dataframeì˜ ë‚´ìš©ì„ ì¶œë ¥í•˜ì§€ë§Œ spark Dataframeì€ dataframeì˜ schemaë§Œ ì¶œë ¥

In [5]:
titanic_sdf.head(5) # row ê°ì²´ 5ê°œê°€ ëª¨ì¸ list

[Row(PassengerId=1, Survived=0, Pclass=3, Name='Braund, Mr. Owen Harris', Sex='male', Age=22.0, SibSp=1, Parch=0, Ticket='A/5 21171', Fare=7.25, Cabin=None, Embarked='S'),
 Row(PassengerId=2, Survived=1, Pclass=1, Name='Cumings, Mrs. John Bradley (Florence Briggs Thayer)', Sex='female', Age=38.0, SibSp=1, Parch=0, Ticket='PC 17599', Fare=71.2833, Cabin='C85', Embarked='C'),
 Row(PassengerId=3, Survived=1, Pclass=3, Name='Heikkinen, Miss. Laina', Sex='female', Age=26.0, SibSp=0, Parch=0, Ticket='STON/O2. 3101282', Fare=7.925, Cabin=None, Embarked='S'),
 Row(PassengerId=4, Survived=1, Pclass=1, Name='Futrelle, Mrs. Jacques Heath (Lily May Peel)', Sex='female', Age=35.0, SibSp=1, Parch=0, Ticket='113803', Fare=53.1, Cabin='C123', Embarked='S'),
 Row(PassengerId=5, Survived=0, Pclass=3, Name='Allen, Mr. William Henry', Sex='male', Age=35.0, SibSp=0, Parch=0, Ticket='373450', Fare=8.05, Cabin=None, Embarked='S')]

In [13]:
# limit : transformations
titanic_sdf.limit(5).show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+

In [16]:
# print ë¹„êµ

print(titanic_pdf)  # pandas dataframeì„ print
print('############################################')
print(titanic_sdf) # spark dataframeì„ print -> schema ì •ë³´ë§Œ ê°„ë‹¨íˆ ë‚˜ì˜´.

     PassengerId  Survived  Pclass
0              1         0       3  \
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp
0                              Braund, Mr. Owen Harris    male  22.0      1  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]
############################################
DataFrame[PassengerId: int, Survived: int, Pclass: int, Name: string, Sex: string, Age: double, SibSp: int, Parch: int, Ticket: string, Fare: double, Cabin: string, Embarked: string]

In [18]:
# spark dataframeì„ pandas dataframeìœ¼ë¡œ ë§Œë“¤ê¸°
titanic_sdf.select('Pclass','Embarked').toPandas() # toPandas() ì „ê¹Œì§€ Transformation. ì´í›„ëŠ” action

     Pclass Embarked
0         3        S
1         1        C
2         3        S
3         1        S
4         3        S
..      ...      ...
886       2        S
887       1        S
888       3        S
889       1        C
890       3        Q

[891 rows x 2 columns]

## pandas DataFrameì˜ info()ì— ëŒ€ì‘í•˜ëŠ” Spark DataFrame ë©”ì†Œë“œ ë° ë¡œì§
- pandas DataFrameì˜ info()ëŠ” ì»¬ëŸ¼ëª…, data typeê³¼ not null ê±´ìˆ˜ë¥¼ í•¨ê»˜ ì¶œë ¥
- spark DataFrameì˜ info() ë©”ì†Œë“œê°€ ì—†ìœ¼ë©° ëŒ€ì‹  `printSchema()` ë©”ì†Œë“œë¡œ ìŠ¤í‚¤ë§ˆ(ì»¬ëŸ¼ëª…, data type)ë§Œ ì¶œë ¥
- not null ê±´ìˆ˜ë¥¼ ìœ„í•´ì„œëŠ” ë³„ë„ì˜ SQLì„± ì¿¼ë¦¬ ì‘ì„± í•„ìš”./ isnull() ì´ëŸ°ê±° ì—†ìŒ

In [19]:
# Pandas DataFrameì˜ Info
titanic_pdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [21]:
# spark dfì˜ íƒ€ì…ì€ java object type
titanic_sdf.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

- SQLì˜ count case when ê³¼ ìœ ì‚¬í•œ ë¡œì§ìœ¼ë¡œ null ê°’ì„ í¬í•¨í•œ ì»¬ëŸ¼ í™•ì¸
- What's the problem? íŒŒì´ì¬ì—ì„œ Nullê°’ì„ NaN, Nullì„ ëª¨ë‘ ì‚¬ìš©í•œë‹¤ëŠ” ê²ƒ

In [23]:
from pyspark.sql.functions import count, isnan, when, col

In [24]:
# Spark DFì—ì„œ ì»¬ëŸ¼ë§Œ í™•ì¸
titanic_sdf.columns

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [27]:
# ìœ„ì˜ ë‚˜ì˜¨ ì»¬ëŸ¼ ë³„ë¡œ NaNê°’ì˜ ì¡´ì¬ ì—¬ë¶€ íŒŒì•… ë° ê°œìˆ˜ë¥¼ ì„¸ì•¼ í•œë‹¤.
titanic_sdf.select([count(when(isnan(c)|col(c).isNull(),c)).alias(c) for c in titanic_sdf.columns]).show()

+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
|PassengerId|Survived|Pclass|Name|Sex|Age|SibSp|Parch|Ticket|Fare|Cabin|Embarked|
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
|          0|       0|     0|   0|  0|177|    0|    0|     0|   0|  687|       2|
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+

**comprehension tip**
- comprehension ì½ì„ ë•ŒëŠ” ë¬´ì¡°ê±´ `in` ë’¤ë¶€í„° ì½ëŠ”ë‹¤.
-

In [29]:
def check_spark_null(spark_df):
    return spark_df.select([count(when(isnan(c)|col(c).isNull(),c)).alias(c) for c in titanic_sdf.columns])

check_spark_null(titanic_sdf).show()

+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
|PassengerId|Survived|Pclass|Name|Sex|Age|SibSp|Parch|Ticket|Fare|Cabin|Embarked|
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
|          0|       0|     0|   0|  0|177|    0|    0|     0|   0|  687|       2|
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+

### pandas DataFrmae describe()ì™€ spark DataFrame describe() ë¹„êµ
- spark dataframeì€ pandas dataframeê³¼ ë¹„ìŠ·í•˜ê²Œ describe()ë¥¼ í†µí•´ ëª¨ë“  ì»¬ëŸ¼ê°’ë“¤ì˜ ê±´ìˆ˜/í‰ê· /í‘œì¤€í¸ì°¨/ìµœì†Œê°’/ìµœëŒ€ê°’ ë“±ì˜ ì •ë³´ë¥¼ í™•ì¸í•  ìˆ˜ ìˆìŒ. ë‹¤ë§Œ percentileê°’(IQR)ì„ ë§Œë“¤ì§€ëŠ” ì•ŠìŒ.
- pandas dataframeê³¼ ë‹¤ë¥´ê²Œ describe()ì‹œ ìˆ«ì..?

In [31]:
titanic_pdf.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [34]:
titanic_sdf.describe().show()

# ë¬¸ìì—´ í˜•íƒœ ë°ì´í„°ë„ ìˆ«ìí˜•ìœ¼ë¡œ ë§Œë“¤ì–´ ì§‘ê³„í•œ ê²ƒ

+-------+-----------------+-------------------+------------------+--------------------+------+------------------+------------------+-------------------+------------------+-----------------+-----+--------+
|summary|      PassengerId|           Survived|            Pclass|                Name|   Sex|               Age|             SibSp|              Parch|            Ticket|             Fare|Cabin|Embarked|
+-------+-----------------+-------------------+------------------+--------------------+------+------------------+------------------+-------------------+------------------+-----------------+-----+--------+
|  count|              891|                891|               891|                 891|   891|               714|               891|                891|               891|              891|  204|     889|
|   mean|            446.0| 0.3838383838383838| 2.308641975308642|                null|  null| 29.69911764705882|0.5230078563411896|0.38159371492704824|260318.54916792738| 32.2042079685746| null|    null|
| stddev|257.3538420152301|0.48659245426485753|0.8360712409770491|                null|  null|14.526497332334035|1.1027434322934315| 0.8060572211299488|471609.26868834975|49.69342859718089| null|    null|
|    min|                1|                  0|                 1|"Andersson, Mr. A...|female|              0.42|                 0|                  0|            110152|              0.0|  A10|       C|
|    max|              891|                  1|                 3|van Melkebeke, Mr...|  male|              80.0|                 8|                  6|         WE/P 5735|         512.3292|    T|       S|
+-------+-----------------+-------------------+------------------+--------------------+------+------------------+------------------+-------------------+------------------+-----------------+-----+--------+

In [37]:
# ìˆ«ì í˜•íƒœì˜ ë°ì´í„°ì— ëŒ€í•´ì„œë§Œ describe í•´ë³´ê¸°
titanic_sdf.dtypes

[('PassengerId', 'int'),
 ('Survived', 'int'),
 ('Pclass', 'int'),
 ('Name', 'string'),
 ('Sex', 'string'),
 ('Age', 'double'),
 ('SibSp', 'int'),
 ('Parch', 'int'),
 ('Ticket', 'string'),
 ('Fare', 'double'),
 ('Cabin', 'string'),
 ('Embarked', 'string')]

In [48]:
number_columns = [column_name for column_name, dtype in titanic_sdf.dtypes if dtype != 'string']

In [47]:
number_columns

[('PassengerId', 'int'),
 ('Survived', 'int'),
 ('Pclass', 'int'),
 ('Age', 'double'),
 ('SibSp', 'int'),
 ('Parch', 'int'),
 ('Fare', 'double')]

In [49]:
titanic_sdf.select(number_columns).describe().show()

+-------+-----------------+-------------------+------------------+------------------+------------------+-------------------+-----------------+
|summary|      PassengerId|           Survived|            Pclass|               Age|             SibSp|              Parch|             Fare|
+-------+-----------------+-------------------+------------------+------------------+------------------+-------------------+-----------------+
|  count|              891|                891|               891|               714|               891|                891|              891|
|   mean|            446.0| 0.3838383838383838| 2.308641975308642| 29.69911764705882|0.5230078563411896|0.38159371492704824| 32.2042079685746|
| stddev|257.3538420152301|0.48659245426485753|0.8360712409770491|14.526497332334035|1.1027434322934315| 0.8060572211299488|49.69342859718089|
|    min|                1|                  0|                 1|              0.42|                 0|                  0|              0.0|
|    max|              891|                  1|                 3|              80.0|                 8|                  6|         512.3292|
+-------+-----------------+-------------------+------------------+------------------+------------------+-------------------+-----------------+

---

# pandas DataFrameì˜ shapeì— ì´ì— ëŒ€ì‘í•˜ëŠ” spark Dataframe ë¡œì§
- pandas DataFrameì˜ shapeëŠ” rowê±´ìˆ˜ì™€ column ê°œìˆ˜ë¥¼ ë§¤ìš° ë¹ ë¥´ê²Œ ì œê³µ
- sparkp DataFrameì€ shapeë¥¼ ì œê³µí•˜ì§€ ì•ŠìŒ. column ê°œìˆ˜ëŠ” spark DataFrameì˜ columnsë¡œ í™•ì¸. rowê±´ìˆ˜ëŠ” count() ë©”ì†Œë“œ(ì¿¼ë¦¬ì„±)ë¡œ í™•ì¸

In [51]:
titanic_pdf.shape

(891, 12)

In [52]:
# Spark DataFrameì—ì„œ ì»¬ëŸ¼ ê°œìˆ˜ ì–»ì–´ë‚´ê¸°
print('ì»¬ëŸ¼ ê°œìˆ˜: ', len(titanic_sdf.columns))

ì»¬ëŸ¼ ê°œìˆ˜:  12

In [53]:
print('ë°ì´í„° ê°œìˆ˜: ', titanic_sdf.count())

ë°ì´í„° ê°œìˆ˜:  891

In [55]:
print('titanic_sdf shape : ', (titanic_sdf.count(), len(titanic_sdf.columns)))

titanic_sdf shape :  (891, 12)

# Spark DataFrameì˜ select() ë©”ì†Œë“œ ì•Œì•„ë³´ê¸° â­ğŸŒŸ
- select() ë©”ì†Œë“œëŠ” SQLì˜ SELECT ì ˆê³¼ ìœ ì‚¬í•˜ê²Œ í•œê°œ ì´ìƒì˜ ì»¬ëŸ¼ë“¤ì˜ ê°’ì„ DataFrameí˜•íƒœë¡œ ë°˜í™˜
- í•œê°œì˜ ì»¬ëŸ¼ëª…, ë˜ëŠ” ì—¬ëŸ¬ê°œì˜ ì»¬ëŸ¼ëª…ì„ ì¸ìë¡œ ì…ë ¥í•  ìˆ˜ ìˆìŒ.
- ê°œë³„ ì»¬ëŸ¼ëª…ì„ ë¬¸ìì—´ í˜•íƒœë¡œ ë˜ëŠ” DataFrameì˜ ì»¬ëŸ¼ ì†ì„±ìœ¼ë¡œ ì§€ì •.
- DataFrameì˜ ì»¬ëŸ¼ ì†ì„±ìœ¼ë¡œ ì§€ì •ì‹œì—ëŠ” DataFrame, ì»¬ëŸ¼ëª…, DataFrame[ì»¬ëŸ¼ëª…], col(ì»¬ëŸ¼ëª…)ìœ¼ë¡œ ì§€ì • ê°€ëŠ¥.

In [57]:
# Pandas ë°ì´í„°í”„ë ˆì„ì—ì„œ ë‹¨ì¼ ì»¬ëŸ¼ê°’ ê°€ì ¸ì˜¤ê¸°
titanic_pdf['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [58]:
titanic_pdf[['Name','Fare']]

                                                  Name     Fare
0                              Braund, Mr. Owen Harris   7.2500
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  71.2833
2                               Heikkinen, Miss. Laina   7.9250
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  53.1000
4                             Allen, Mr. William Henry   8.0500
..                                                 ...      ...
886                              Montvila, Rev. Juozas  13.0000
887                       Graham, Miss. Margaret Edith  30.0000
888           Johnston, Miss. Catherine Helen "Carrie"  23.4500
889                              Behr, Mr. Karl Howell  30.0000
890                                Dooley, Mr. Patrick   7.7500

[891 rows x 2 columns]

In [60]:
# Spark DataFrameì˜ select ì‚¬ìš©
titanic_sdf.select('Name').show() # SELECT name FROM titanic_sdf

+--------------------+
|                Name|
+--------------------+
|Braund, Mr. Owen ...|
|Cumings, Mrs. Joh...|
|Heikkinen, Miss. ...|
|Futrelle, Mrs. Ja...|
|Allen, Mr. Willia...|
|    Moran, Mr. James|
|McCarthy, Mr. Tim...|
|Palsson, Master. ...|
|Johnson, Mrs. Osc...|
|Nasser, Mrs. Nich...|
|Sandstrom, Miss. ...|
|Bonnell, Miss. El...|
|Saundercock, Mr. ...|
|Andersson, Mr. An...|
|Vestrom, Miss. Hu...|
|Hewlett, Mrs. (Ma...|
|Rice, Master. Eugene|
|Williams, Mr. Cha...|
|Vander Planke, Mr...|
|Masselmani, Mrs. ...|
+--------------------+
only showing top 20 rows

In [61]:
# ì—¬ëŸ¬ ê°œì˜ ì»¬ëŸ¼ì„ select
titanic_sdf.select("Name","Fare").show() # ë‚´ë¶€ì— select(*args) ì²˜ëŸ¼ êµ¬í˜„ë˜ì—‰ ìˆìŒ,

+--------------------+-------+
|                Name|   Fare|
+--------------------+-------+
|Braund, Mr. Owen ...|   7.25|
|Cumings, Mrs. Joh...|71.2833|
|Heikkinen, Miss. ...|  7.925|
|Futrelle, Mrs. Ja...|   53.1|
|Allen, Mr. Willia...|   8.05|
|    Moran, Mr. James| 8.4583|
|McCarthy, Mr. Tim...|51.8625|
|Palsson, Master. ...| 21.075|
|Johnson, Mrs. Osc...|11.1333|
|Nasser, Mrs. Nich...|30.0708|
|Sandstrom, Miss. ...|   16.7|
|Bonnell, Miss. El...|  26.55|
|Saundercock, Mr. ...|   8.05|
|Andersson, Mr. An...| 31.275|
|Vestrom, Miss. Hu...| 7.8542|
|Hewlett, Mrs. (Ma...|   16.0|
|Rice, Master. Eugene| 29.125|
|Williams, Mr. Cha...|   13.0|
|Vander Planke, Mr...|   18.0|
|Masselmani, Mrs. ...|  7.225|
+--------------------+-------+
only showing top 20 rows

In [63]:
# Nameë§Œ ë¹¼ê³  ê°€ì ¸ì˜¤ê³  ì‹¶ì„ ë•Œ

select_columns = titanic_sdf.columns
select_columns.remove('Name')
select_columns

['PassengerId',
 'Survived',
 'Pclass',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

- *list ì‚¬ìš©í•˜ê±°ë‚˜ listë¥¼ ê·¸ëŒ€ë¡œ ì‚¬ìš©í•´ì„œ ë°ì´í„°ë¥¼ ì¡°íšŒ
    - *list : list ë‚´ì˜ ëª¨ë“  ì›ì†Œë¥¼ unpack í•œë‹¤. ìŠ¤íŒŒí¬ ë°ì´í„°í”„ë ˆì„ì—ì„œëŠ” ë¦¬ìŠ¤íŠ¸ê°€ ì•„ë‹Œ, ì»¬ëŸ¼ì˜ ëª©ë¡ì´ ê·¸ëŒ€ë¡œ ë“¤ì–´ê°€ëŠ” ê²ƒì´ ì›ì¹™!
-  select ('A','B','C') ì²˜ëŸ¼ ì„ íƒí•˜ëŠ” ê²ƒì´ ì›ì¹™! ê·¸ëŸ°ë° ë²„ì „ ì—…ì´ ë˜ë©´ì„œ select(['A','B','C']) ì²˜ëŸ¼ ë¦¬ìŠ¤íŠ¸ê°€ ê·¸ëŒ€ë¡œ ë“¤ì–´ê°ˆ ìˆ˜ ìˆê²Œ ë¨.

In [64]:
print(select_columns, *select_columns)

['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'] PassengerId Survived Pclass Sex Age SibSp Parch Ticket Fare Cabin Embarked

In [67]:
titanic_sdf.select(select_columns).show()
titanic_sdf.select(*select_columns).show() # ìœ„ì—ê±°ë¥¼ ì§€ì›í•˜ê³ ëŠ” ìˆì§€ë§Œ,ì´ê²Œ ì›ì¹™

+-----------+--------+------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         17|       0|     3|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|
|         18|       1|     2|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         20|       1|     3|female|null|    0|    0|            2649|  7.225| null|       C|
+-----------+--------+------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

+-----------+--------+------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         17|       0|     3|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|
|         18|       1|     2|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         20|       1|     3|female|null|    0|    0|            2649|  7.225| null|       C|
+-----------+--------+------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [68]:

# ì»¬ëŸ¼ ì†ì„±ìœ¼ë¡œ ì§€ì •í•˜ê¸°. ë¸Œë¼ì¼“( [ ] ) ì„ í™œìš©í•˜ì—¬ ì»¬ëŸ¼ì§€ì •
# pandas dataframeì˜ ë¸Œë¼ì¼“ì€ 'ì»¬ëŸ¼ì„ í¬í•¨í•œ ë°°ì—´(ì‹œë¦¬ì¦ˆ, DataFrame)'
# spark dataframeì˜ ë¸Œë¼ì¼“ì€ 'ì»¬ëŸ¼ ìì²´'ë¥¼ ì§€ì •
titanic_sdf['Name']

Column<'Name'>

In [70]:
# ê·¸ë˜ì„œ ì»¬ëŸ¼ ë‚´ìš©ì„ ì¡°íšŒí•˜ë ¤ë©´ select ì‚¬ìš©
titanic_sdf.select(titanic_sdf['Name']).show()

+--------------------+
|                Name|
+--------------------+
|Braund, Mr. Owen ...|
|Cumings, Mrs. Joh...|
|Heikkinen, Miss. ...|
|Futrelle, Mrs. Ja...|
|Allen, Mr. Willia...|
|    Moran, Mr. James|
|McCarthy, Mr. Tim...|
|Palsson, Master. ...|
|Johnson, Mrs. Osc...|
|Nasser, Mrs. Nich...|
|Sandstrom, Miss. ...|
|Bonnell, Miss. El...|
|Saundercock, Mr. ...|
|Andersson, Mr. An...|
|Vestrom, Miss. Hu...|
|Hewlett, Mrs. (Ma...|
|Rice, Master. Eugene|
|Williams, Mr. Cha...|
|Vander Planke, Mr...|
|Masselmani, Mrs. ...|
+--------------------+
only showing top 20 rows

In [71]:
titanic_sdf.select(titanic_sdf.Name).show()

+--------------------+
|                Name|
+--------------------+
|Braund, Mr. Owen ...|
|Cumings, Mrs. Joh...|
|Heikkinen, Miss. ...|
|Futrelle, Mrs. Ja...|
|Allen, Mr. Willia...|
|    Moran, Mr. James|
|McCarthy, Mr. Tim...|
|Palsson, Master. ...|
|Johnson, Mrs. Osc...|
|Nasser, Mrs. Nich...|
|Sandstrom, Miss. ...|
|Bonnell, Miss. El...|
|Saundercock, Mr. ...|
|Andersson, Mr. An...|
|Vestrom, Miss. Hu...|
|Hewlett, Mrs. (Ma...|
|Rice, Master. Eugene|
|Williams, Mr. Cha...|
|Vander Planke, Mr...|
|Masselmani, Mrs. ...|
+--------------------+
only showing top 20 rows

In [69]:
titanic_pdf['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [74]:
# ì•„ë˜ì™€ ê°™ì´ ì…ë ¥í•˜ë©´ ì•„ì§ ê³„ì‚° ì§„í–‰ë˜ì§€ ì•ŠìŒ.
# ì™œ? sparkëŠ” lazy executionì´ë‹ˆê¹Œ
titanic_sdf.Fare*100

Column<'(Fare * 100)'>

In [77]:
titanic_sdf.select(titanic_sdf.Fare,titanic_sdf['Fare']*100).show()

+-------+-----------------+
|   Fare|     (Fare * 100)|
+-------+-----------------+
|   7.25|            725.0|
|71.2833|          7128.33|
|  7.925|            792.5|
|   53.1|           5310.0|
|   8.05|805.0000000000001|
| 8.4583|845.8299999999999|
|51.8625|          5186.25|
| 21.075|           2107.5|
|11.1333|          1113.33|
|30.0708|          3007.08|
|   16.7|           1670.0|
|  26.55|           2655.0|
|   8.05|805.0000000000001|
| 31.275|           3127.5|
| 7.8542|           785.42|
|   16.0|           1600.0|
| 29.125|           2912.5|
|   13.0|           1300.0|
|   18.0|           1800.0|
|  7.225|            722.5|
+-------+-----------------+
only showing top 20 rows

In [83]:
# ìŠ¤íŒŒí¬ ë°ì´í„° í”„ë ˆì„ì—ì„œ ì»¬ëŸ¼ì„ ë‹¤ë£° ë•Œ ê°€ì¥ ë§ì´ ì‚¬ìš©í•˜ëŠ” ë°©ì‹
from pyspark.sql.functions import col

titanic_sdf.select(col('Name'),col('Fare')).show()

+--------------------+-------+
|                Name|   Fare|
+--------------------+-------+
|Braund, Mr. Owen ...|   7.25|
|Cumings, Mrs. Joh...|71.2833|
|Heikkinen, Miss. ...|  7.925|
|Futrelle, Mrs. Ja...|   53.1|
|Allen, Mr. Willia...|   8.05|
|    Moran, Mr. James| 8.4583|
|McCarthy, Mr. Tim...|51.8625|
|Palsson, Master. ...| 21.075|
|Johnson, Mrs. Osc...|11.1333|
|Nasser, Mrs. Nich...|30.0708|
|Sandstrom, Miss. ...|   16.7|
|Bonnell, Miss. El...|  26.55|
|Saundercock, Mr. ...|   8.05|
|Andersson, Mr. An...| 31.275|
|Vestrom, Miss. Hu...| 7.8542|
|Hewlett, Mrs. (Ma...|   16.0|
|Rice, Master. Eugene| 29.125|
|Williams, Mr. Cha...|   13.0|
|Vander Planke, Mr...|   18.0|
|Masselmani, Mrs. ...|  7.225|
+--------------------+-------+
only showing top 20 rows

In [92]:
from pyspark.sql.functions import upper, lower, col

# 1. ë¸Œë¼ì¼“ì„ í™œìš©í•´ì„œ í•¨ìˆ˜ ì—°ì‚° ì ìš©
titanic_sdf.select('Name',upper(titanic_sdf.Name)).show()

# 2. .ì„ í™œìš©í•´ì„œ í•¨ìˆ˜ ì—°ì‚° ì ìš©
titanic_sdf.select('Name', upper(titanic_sdf['Name'])).show()

# 3. colì„ í™œìš©í•´ì„œ í•¨ìˆ˜ ì—°ì‚° ì ìš©
titanic_sdf.select('Name', upper(col('Name')).alias('Capped Name')).show()

+--------------------+--------------------+
|                Name|         upper(Name)|
+--------------------+--------------------+
|Braund, Mr. Owen ...|BRAUND, MR. OWEN ...|
|Cumings, Mrs. Joh...|CUMINGS, MRS. JOH...|
|Heikkinen, Miss. ...|HEIKKINEN, MISS. ...|
|Futrelle, Mrs. Ja...|FUTRELLE, MRS. JA...|
|Allen, Mr. Willia...|ALLEN, MR. WILLIA...|
|    Moran, Mr. James|    MORAN, MR. JAMES|
|McCarthy, Mr. Tim...|MCCARTHY, MR. TIM...|
|Palsson, Master. ...|PALSSON, MASTER. ...|
|Johnson, Mrs. Osc...|JOHNSON, MRS. OSC...|
|Nasser, Mrs. Nich...|NASSER, MRS. NICH...|
|Sandstrom, Miss. ...|SANDSTROM, MISS. ...|
|Bonnell, Miss. El...|BONNELL, MISS. EL...|
|Saundercock, Mr. ...|SAUNDERCOCK, MR. ...|
|Andersson, Mr. An...|ANDERSSON, MR. AN...|
|Vestrom, Miss. Hu...|VESTROM, MISS. HU...|
|Hewlett, Mrs. (Ma...|HEWLETT, MRS. (MA...|
|Rice, Master. Eugene|RICE, MASTER. EUGENE|
|Williams, Mr. Cha...|WILLIAMS, MR. CHA...|
|Vander Planke, Mr...|VANDER PLANKE, MR...|
|Masselmani, Mrs. ...|MASSELMANI, MRS. ...|
+--------------------+--------------------+
only showing top 20 rows

+--------------------+--------------------+
|                Name|         upper(Name)|
+--------------------+--------------------+
|Braund, Mr. Owen ...|BRAUND, MR. OWEN ...|
|Cumings, Mrs. Joh...|CUMINGS, MRS. JOH...|
|Heikkinen, Miss. ...|HEIKKINEN, MISS. ...|
|Futrelle, Mrs. Ja...|FUTRELLE, MRS. JA...|
|Allen, Mr. Willia...|ALLEN, MR. WILLIA...|
|    Moran, Mr. James|    MORAN, MR. JAMES|
|McCarthy, Mr. Tim...|MCCARTHY, MR. TIM...|
|Palsson, Master. ...|PALSSON, MASTER. ...|
|Johnson, Mrs. Osc...|JOHNSON, MRS. OSC...|
|Nasser, Mrs. Nich...|NASSER, MRS. NICH...|
|Sandstrom, Miss. ...|SANDSTROM, MISS. ...|
|Bonnell, Miss. El...|BONNELL, MISS. EL...|
|Saundercock, Mr. ...|SAUNDERCOCK, MR. ...|
|Andersson, Mr. An...|ANDERSSON, MR. AN...|
|Vestrom, Miss. Hu...|VESTROM, MISS. HU...|
|Hewlett, Mrs. (Ma...|HEWLETT, MRS. (MA...|
|Rice, Master. Eugene|RICE, MASTER. EUGENE|
|Williams, Mr. Cha...|WILLIAMS, MR. CHA...|
|Vander Planke, Mr...|VANDER PLANKE, MR...|
|Masselmani, Mrs. ...|MASSELMANI, MRS. ...|
+--------------------+--------------------+
only showing top 20 rows

+--------------------+--------------------+
|                Name|         Capped Name|
+--------------------+--------------------+
|Braund, Mr. Owen ...|BRAUND, MR. OWEN ...|
|Cumings, Mrs. Joh...|CUMINGS, MRS. JOH...|
|Heikkinen, Miss. ...|HEIKKINEN, MISS. ...|
|Futrelle, Mrs. Ja...|FUTRELLE, MRS. JA...|
|Allen, Mr. Willia...|ALLEN, MR. WILLIA...|
|    Moran, Mr. James|    MORAN, MR. JAMES|
|McCarthy, Mr. Tim...|MCCARTHY, MR. TIM...|
|Palsson, Master. ...|PALSSON, MASTER. ...|
|Johnson, Mrs. Osc...|JOHNSON, MRS. OSC...|
|Nasser, Mrs. Nich...|NASSER, MRS. NICH...|
|Sandstrom, Miss. ...|SANDSTROM, MISS. ...|
|Bonnell, Miss. El...|BONNELL, MISS. EL...|
|Saundercock, Mr. ...|SAUNDERCOCK, MR. ...|
|Andersson, Mr. An...|ANDERSSON, MR. AN...|
|Vestrom, Miss. Hu...|VESTROM, MISS. HU...|
|Hewlett, Mrs. (Ma...|HEWLETT, MRS. (MA...|
|Rice, Master. Eugene|RICE, MASTER. EUGENE|
|Williams, Mr. Cha...|WILLIAMS, MR. CHA...|
|Vander Planke, Mr...|VANDER PLANKE, MR...|
|Masselmani, Mrs. ...|MASSELMANI, MRS. ...|
+--------------------+--------------------+
only showing top 20 rows

# ì¿¼ë¦¬ëŠ” ì¡°íšŒ, ë°ì´í„° ì „ì²˜ë¦¬ = ë°ì´í„° í”„ë ˆì„ APIë¡œ í•˜ëŠ”ê²Œ ì¢‹ìŒ

# spark DataFrame filter() ë©”ì†Œë“œ ì•Œì•„ë³´ê¸°
- filter()ëŠ” SQLì˜ `where`ì™€ ìœ ì‚¬í•˜ê²Œ DataFrame ë‚´ì˜ íŠ¹ì • ì¡°ê±´ì„ ë§Œì¡±í•˜ëŠ” ë ˆì½”ë“œë¥¼ DataFrameìœ¼ë¡œ ë°˜í™˜.
- filter()ë‚´ì˜ ì¡°ê±´ ì»¬ëŸ¼ì€ `ì»¬ëŸ¼ ì†ì„±`ìœ¼ë¡œ ì§€ì • ê°€ëŠ¥. ì¡°ê±´ë¬¸ ìì²´ëŠ” SQLê³¼ ìœ ì‚¬í•œ ë¬¸ìì—´ë¡œ ì§€ì •í•  ìˆ˜ ìˆìŒ(ì¡°ê±´ ì»¬ëŸ¼ì€ ë¬¸ìì—´ ì§€ì •ì´ ì•ˆë¨.)
- filter() = where()
- where() ë©”ì†Œë“œëŠ” filter()ì˜ aliasì´ë©° SQL whereì™€ ì§ê´€ì ì¸ ë™ì¼ì„±ì„ ê°–ì¶”ê¸° ìœ„í•´ ìƒì„±.
- ë³µí•© ì¡°ê±´ andëŠ” `&` ë¡œ, orë¥¼ `|`ë¡œ ì‚¬ìš©. ê°œë³„ì¡°ê±´ì€ ()ë¡œ ê°ì‹¸ì•¼ í•¨.

In [94]:
titanic_sdf.filter(col('Embarked') == 'Q').show()

# titanic_sdf.filter("Embarked"=="Q").show() ëŠ” ì•ˆë¨!!!!!!

+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|Ticket|  Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|330877|8.4583| null|       Q|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|382652|29.125| null|       Q|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|330923|8.0292| null|       Q|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|330959|7.8792| null|       Q|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|335677|  7.75| null|       Q|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|330958|7.8792| null|       Q|
|         47|       0|     3|   Lennon, Mr. Denis|  male|null|    1|    0|370371|  15.5| null|       Q|
|         48|       1|     3|O'Driscoll, Miss....|female|null|    0|    0| 14311|  7.75| null|       Q|
|         83|       1|     3|McDermott, Miss. ...|female|null|    0|    0|330932|7.7875| null|       Q|
|        110|       1|     3| Moran, Miss. Bertha|female|null|    1|    0|371110| 24.15| null|       Q|
|        117|       0|     3|Connors, Mr. Patrick|  male|70.5|    0|    0|370369|  7.75| null|       Q|
|        127|       0|     3| McMahon, Mr. Martin|  male|null|    0|    0|370372|  7.75| null|       Q|
|        144|       0|     3| Burke, Mr. Jeremiah|  male|19.0|    0|    0|365222|  6.75| null|       Q|
|        157|       1|     3|"Gilnagh, Miss. K...|female|16.0|    0|    0| 35851|7.7333| null|       Q|
|        172|       0|     3|Rice, Master. Arthur|  male| 4.0|    4|    1|382652|29.125| null|       Q|
|        187|       1|     3|"O'Brien, Mrs. Th...|female|null|    1|    0|370365|  15.5| null|       Q|
|        189|       0|     3|    Bourke, Mr. John|  male|40.0|    1|    1|364849|  15.5| null|       Q|
|        197|       0|     3| Mernagh, Mr. Robert|  male|null|    0|    0|368703|  7.75| null|       Q|
|        199|       1|     3|"Madigan, Miss. M...|female|null|    0|    0|370370|  7.75| null|       Q|
|        209|       1|     3|"Carr, Miss. Hele...|female|16.0|    0|    0|367231|  7.75| null|       Q|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
only showing top 20 rows

In [95]:
titanic_sdf.where(col('Embarked') == 'Q').show()

+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|Ticket|  Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|330877|8.4583| null|       Q|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|382652|29.125| null|       Q|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|330923|8.0292| null|       Q|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|330959|7.8792| null|       Q|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|335677|  7.75| null|       Q|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|330958|7.8792| null|       Q|
|         47|       0|     3|   Lennon, Mr. Denis|  male|null|    1|    0|370371|  15.5| null|       Q|
|         48|       1|     3|O'Driscoll, Miss....|female|null|    0|    0| 14311|  7.75| null|       Q|
|         83|       1|     3|McDermott, Miss. ...|female|null|    0|    0|330932|7.7875| null|       Q|
|        110|       1|     3| Moran, Miss. Bertha|female|null|    1|    0|371110| 24.15| null|       Q|
|        117|       0|     3|Connors, Mr. Patrick|  male|70.5|    0|    0|370369|  7.75| null|       Q|
|        127|       0|     3| McMahon, Mr. Martin|  male|null|    0|    0|370372|  7.75| null|       Q|
|        144|       0|     3| Burke, Mr. Jeremiah|  male|19.0|    0|    0|365222|  6.75| null|       Q|
|        157|       1|     3|"Gilnagh, Miss. K...|female|16.0|    0|    0| 35851|7.7333| null|       Q|
|        172|       0|     3|Rice, Master. Arthur|  male| 4.0|    4|    1|382652|29.125| null|       Q|
|        187|       1|     3|"O'Brien, Mrs. Th...|female|null|    1|    0|370365|  15.5| null|       Q|
|        189|       0|     3|    Bourke, Mr. John|  male|40.0|    1|    1|364849|  15.5| null|       Q|
|        197|       0|     3| Mernagh, Mr. Robert|  male|null|    0|    0|368703|  7.75| null|       Q|
|        199|       1|     3|"Madigan, Miss. M...|female|null|    0|    0|370370|  7.75| null|       Q|
|        209|       1|     3|"Carr, Miss. Hele...|female|16.0|    0|    0|367231|  7.75| null|       Q|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
only showing top 20 rows

In [97]:
titanic_sdf.filter("Embarked == 'Q'").show()

+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|Ticket|  Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|330877|8.4583| null|       Q|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|382652|29.125| null|       Q|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|330923|8.0292| null|       Q|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|330959|7.8792| null|       Q|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|335677|  7.75| null|       Q|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|330958|7.8792| null|       Q|
|         47|       0|     3|   Lennon, Mr. Denis|  male|null|    1|    0|370371|  15.5| null|       Q|
|         48|       1|     3|O'Driscoll, Miss....|female|null|    0|    0| 14311|  7.75| null|       Q|
|         83|       1|     3|McDermott, Miss. ...|female|null|    0|    0|330932|7.7875| null|       Q|
|        110|       1|     3| Moran, Miss. Bertha|female|null|    1|    0|371110| 24.15| null|       Q|
|        117|       0|     3|Connors, Mr. Patrick|  male|70.5|    0|    0|370369|  7.75| null|       Q|
|        127|       0|     3| McMahon, Mr. Martin|  male|null|    0|    0|370372|  7.75| null|       Q|
|        144|       0|     3| Burke, Mr. Jeremiah|  male|19.0|    0|    0|365222|  6.75| null|       Q|
|        157|       1|     3|"Gilnagh, Miss. K...|female|16.0|    0|    0| 35851|7.7333| null|       Q|
|        172|       0|     3|Rice, Master. Arthur|  male| 4.0|    4|    1|382652|29.125| null|       Q|
|        187|       1|     3|"O'Brien, Mrs. Th...|female|null|    1|    0|370365|  15.5| null|       Q|
|        189|       0|     3|    Bourke, Mr. John|  male|40.0|    1|    1|364849|  15.5| null|       Q|
|        197|       0|     3| Mernagh, Mr. Robert|  male|null|    0|    0|368703|  7.75| null|       Q|
|        199|       1|     3|"Madigan, Miss. M...|female|null|    0|    0|370370|  7.75| null|       Q|
|        209|       1|     3|"Carr, Miss. Hele...|female|16.0|    0|    0|367231|  7.75| null|       Q|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
only showing top 20 rows

In [104]:
# Embarkedê°€ 'S'ì´ê³  Pclassê°€ 1ì¸ ì‚¬ëŒì˜ ì •ë³´ (AND)
titanic_sdf.filter((col('Embarked')=='S')& (col('pclass')==1)).show()

+-----------+--------+------+--------------------+------+----+-----+-----+-----------+-------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|     Ticket|   Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+-------+-----------+--------+
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|     113803|   53.1|       C123|       S|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|      17463|51.8625|        E46|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|     113783|  26.55|       C103|       S|
|         24|       1|     1|Sloper, Mr. Willi...|  male|28.0|    0|    0|     113788|   35.5|         A6|       S|
|         28|       0|     1|Fortune, Mr. Char...|  male|19.0|    3|    2|      19950|  263.0|C23 C25 C27|       S|
|         36|       0|     1|Holverson, Mr. Al...|  male|42.0|    1|    0|     113789|   52.0|       null|       S|
|         56|       1|     1|   Woolner, Mr. Hugh|  male|null|    0|    0|      19947|   35.5|        C52|       S|
|         63|       0|     1|Harris, Mr. Henry...|  male|45.0|    1|    0|      36973| 83.475|        C83|       S|
|         84|       0|     1|Carrau, Mr. Franc...|  male|28.0|    0|    0|     113059|   47.1|       null|       S|
|         89|       1|     1|Fortune, Miss. Ma...|female|23.0|    3|    2|      19950|  263.0|C23 C25 C27|       S|
|         93|       0|     1|Chaffee, Mr. Herb...|  male|46.0|    1|    0|W.E.P. 5734| 61.175|        E31|       S|
|        103|       0|     1|White, Mr. Richar...|  male|21.0|    0|    1|      35281|77.2875|        D26|       S|
|        111|       0|     1|Porter, Mr. Walte...|  male|47.0|    0|    0|     110465|   52.0|       C110|       S|
|        125|       0|     1|White, Mr. Perciv...|  male|54.0|    0|    1|      35281|77.2875|        D26|       S|
|        137|       1|     1|Newsom, Miss. Hel...|female|19.0|    0|    2|      11752|26.2833|        D47|       S|
|        138|       0|     1|Futrelle, Mr. Jac...|  male|37.0|    1|    0|     113803|   53.1|       C123|       S|
|        152|       1|     1|Pears, Mrs. Thoma...|female|22.0|    1|    0|     113776|   66.6|         C2|       S|
|        167|       1|     1|Chibnall, Mrs. (E...|female|null|    0|    1|     113505|   55.0|        E33|       S|
|        169|       0|     1| Baumann, Mr. John D|  male|null|    0|    0|   PC 17318| 25.925|       null|       S|
|        171|       0|     1|Van der hoef, Mr....|  male|61.0|    0|    0|     111240|   33.5|        B19|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+-------+-----------+--------+
only showing top 20 rows

In [105]:
# Embarkedê°€ 'S'ì´ê±°ë‚˜ Pclassê°€ 1ì¸ ì‚¬ëŒì˜ ì •ë³´ (OR)
titanic_sdf.filter((col('Embarked')=='S')| (col('pclass')==1)).show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         21|       0|     2|Fynney, Mr. Joseph J|  male|35.0|    0|    0|          239865|   26.0| null|       S|
|         22|       1|     2|Beesley, Mr. Lawr...|  male|34.0|    0|    0|          248698|   13.0|  D56|       S|
|         24|       1|     1|Sloper, Mr. Willi...|  male|28.0|    0|    0|          113788|   35.5|   A6|       S|
|         25|       0|     3|Palsson, Miss. To...|female| 8.0|    3|    1|          349909| 21.075| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [106]:
# ì´ë¦„ì— Missê°€ ë“¤ì–´ê°€ëŠ” ì‚¬ëŒì˜ ì •ë³´ ê°€ì ¸ì˜¤ê¸°
titanic_sdf.filter( col('Name').like('%Miss%')).show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|          330923| 8.0292| null|       Q|
|         25|       0|     3|Palsson, Miss. To...|female| 8.0|    3|    1|          349909| 21.075| null|       S|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|          330959| 7.8792| null|       Q|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|          335677|   7.75| null|       Q|
|         39|       0|     3|Vander Planke, Mi...|female|18.0|    2|    0|          345764|   18.0| null|       S|
|         40|       1|     3|Nicola-Yarred, Mi...|female|14.0|    1|    0|            2651|11.2417| null|       C|
|         44|       1|     2|Laroche, Miss. Si...|female| 3.0|    1|    2|   SC/Paris 2123|41.5792| null|       C|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|          330958| 7.8792| null|       Q|
|         48|       1|     3|O'Driscoll, Miss....|female|null|    0|    0|           14311|   7.75| null|       Q|
|         57|       1|     2|   Rugg, Miss. Emily|female|21.0|    0|    0|      C.A. 31026|   10.5| null|       S|
|         59|       1|     2|West, Miss. Const...|female| 5.0|    1|    2|      C.A. 34651|  27.75| null|       S|
|         62|       1|     1| Icard, Miss. Amelie|female|38.0|    0|    0|          113572|   80.0|  B28|    null|
|         69|       1|     3|Andersson, Miss. ...|female|17.0|    4|    2|         3101281|  7.925| null|       S|
|         72|       0|     3|Goodwin, Miss. Li...|female|16.0|    5|    2|         CA 2144|   46.9| null|       S|
|         80|       1|     3|Dowdell, Miss. El...|female|30.0|    0|    0|          364516| 12.475| null|       S|
|         83|       1|     3|McDermott, Miss. ...|female|null|    0|    0|          330932| 7.7875| null|       Q|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [108]:
# ì´ë¦„ì´ Hë¡œ ì‹œì‘í•˜ëŠ” ì‚¬ëŒ
titanic_sdf.filter( upper(col('Name')).like('H%')).show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         36|       0|     1|Holverson, Mr. Al...|  male|42.0|    1|    0|          113789|   52.0| null|       S|
|         53|       1|     1|Harper, Mrs. Henr...|female|49.0|    1|    0|        PC 17572|76.7292|  D33|       C|
|         63|       0|     1|Harris, Mr. Henry...|  male|45.0|    1|    0|           36973| 83.475|  C83|       S|
|         73|       0|     2|Hood, Mr. Ambrose Jr|  male|21.0|    0|    0|    S.O.C. 14879|   73.5| null|       S|
|        121|       0|     2|Hickman, Mr. Stan...|  male|21.0|    2|    0|    S.O.C. 14879|   73.5| null|       S|
|        143|       1|     3|Hakkarainen, Mrs....|female|24.0|    1|    0|STON/O2. 3101279|  15.85| null|       S|
|        179|       0|     2|  Hale, Mr. Reginald|  male|30.0|    0|    0|          250653|   13.0| null|       S|
|        217|       1|     3|Honkanen, Miss. E...|female|27.0|    0|    0|STON/O2. 3101283|  7.925| null|       S|
|        220|       0|     2|  Harris, Mr. Walter|  male|30.0|    0|    0|       W/C 14208|   10.5| null|       S|
|        225|       1|     1|Hoyt, Mr. Frederi...|  male|38.0|    1|    0|           19943|   90.0|  C93|       S|
|        231|       1|     1|Harris, Mrs. Henr...|female|35.0|    1|    0|           36973| 83.475|  C83|       S|
|        236|       0|     3|Harknett, Miss. A...|female|null|    0|    0|      W./C. 6609|   7.55| null|       S|
|        237|       0|     2|   Hold, Mr. Stephen|  male|44.0|    1|    0|           26707|   26.0| null|       S|
|        240|       0|     2|Hunt, Mr. George ...|  male|33.0|    0|    0|      SCO/W 1585| 12.275| null|       S|
|        248|       1|     2|Hamalainen, Mrs. ...|female|24.0|    0|    2|          250649|   14.5| null|       S|
|        264|       0|     1|Harrison, Mr. Wil...|  male|40.0|    0|    0|          112059|    0.0|  B94|       S|
|        265|       0|     3|  Henry, Miss. Delia|female|null|    0|    0|          382649|   7.75| null|       Q|
|        289|       1|     2|Hosono, Mr. Masabumi|  male|42.0|    0|    0|          237798|   13.0| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [109]:
titanic_sdf.filter("Name like '%Mr%'").show()

+-----------+--------+------+--------------------+------+----+-----+-----+---------+-------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|   Ticket|   Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+---------+-------+-----------+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|A/5 21171|   7.25|       null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0| PC 17599|71.2833|        C85|       C|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|   113803|   53.1|       C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|   373450|   8.05|       null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|   330877| 8.4583|       null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|    17463|51.8625|        E46|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|   347742|11.1333|       null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|   237736|30.0708|       null|       C|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|A/5. 2151|   8.05|       null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|   347082| 31.275|       null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|   248706|   16.0|       null|       S|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|   244373|   13.0|       null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|   345763|   18.0|       null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|     2649|  7.225|       null|       C|
|         21|       0|     2|Fynney, Mr. Joseph J|  male|35.0|    0|    0|   239865|   26.0|       null|       S|
|         22|       1|     2|Beesley, Mr. Lawr...|  male|34.0|    0|    0|   248698|   13.0|        D56|       S|
|         24|       1|     1|Sloper, Mr. Willi...|  male|28.0|    0|    0|   113788|   35.5|         A6|       S|
|         26|       1|     3|Asplund, Mrs. Car...|female|38.0|    1|    5|   347077|31.3875|       null|       S|
|         27|       0|     3|Emir, Mr. Farred ...|  male|null|    0|    0|     2631|  7.225|       null|       C|
|         28|       0|     1|Fortune, Mr. Char...|  male|19.0|    3|    2|    19950|  263.0|C23 C25 C27|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+---------+-------+-----------+--------+
only showing top 20 rows

In [111]:
titanic_sdf.filter("lower(Name) like '%mr%'").show() # ë³„ë„ì˜ pyspark.sql.functions í˜¸ì¶œì´ ì—†ì´ ì‚¬ìš©ì´ ê°€ëŠ¥.

+-----------+--------+------+--------------------+------+----+-----+-----+---------+-------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|   Ticket|   Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+---------+-------+-----------+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|A/5 21171|   7.25|       null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0| PC 17599|71.2833|        C85|       C|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|   113803|   53.1|       C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|   373450|   8.05|       null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|   330877| 8.4583|       null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|    17463|51.8625|        E46|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|   347742|11.1333|       null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|   237736|30.0708|       null|       C|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|A/5. 2151|   8.05|       null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|   347082| 31.275|       null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|   248706|   16.0|       null|       S|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|   244373|   13.0|       null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|   345763|   18.0|       null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|     2649|  7.225|       null|       C|
|         21|       0|     2|Fynney, Mr. Joseph J|  male|35.0|    0|    0|   239865|   26.0|       null|       S|
|         22|       1|     2|Beesley, Mr. Lawr...|  male|34.0|    0|    0|   248698|   13.0|        D56|       S|
|         24|       1|     1|Sloper, Mr. Willi...|  male|28.0|    0|    0|   113788|   35.5|         A6|       S|
|         26|       1|     3|Asplund, Mrs. Car...|female|38.0|    1|    5|   347077|31.3875|       null|       S|
|         27|       0|     3|Emir, Mr. Farred ...|  male|null|    0|    0|     2631|  7.225|       null|       C|
|         28|       0|     1|Fortune, Mr. Char...|  male|19.0|    3|    2|    19950|  263.0|C23 C25 C27|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+---------+-------+-----------+--------+
only showing top 20 rows

In [112]:
titanic_sdf.filter(upper(col('Name')).like('%MISS%')).select('Pclass','Embarked','Name').show()

+------+--------+--------------------+
|Pclass|Embarked|                Name|
+------+--------+--------------------+
|     3|       S|Heikkinen, Miss. ...|
|     3|       S|Sandstrom, Miss. ...|
|     1|       S|Bonnell, Miss. El...|
|     3|       S|Vestrom, Miss. Hu...|
|     3|       Q|"McGowan, Miss. A...|
|     3|       S|Palsson, Miss. To...|
|     3|       Q|"O'Dwyer, Miss. E...|
|     3|       Q|Glynn, Miss. Mary...|
|     3|       S|Vander Planke, Mi...|
|     3|       C|Nicola-Yarred, Mi...|
|     2|       C|Laroche, Miss. Si...|
|     3|       Q|Devaney, Miss. Ma...|
|     3|       Q|O'Driscoll, Miss....|
|     2|       S|   Rugg, Miss. Emily|
|     2|       S|West, Miss. Const...|
|     1|    null| Icard, Miss. Amelie|
|     3|       S|Andersson, Miss. ...|
|     3|       S|Goodwin, Miss. Li...|
|     3|       S|Dowdell, Miss. El...|
|     3|       Q|McDermott, Miss. ...|
+------+--------+--------------------+
only showing top 20 rows

In [113]:
spark.stop()